#Использовать asserts
#Использовать "../../src"

#Область Тесты

&ПараметризованныйТест
&ИсточникЗначение("URI")
&ИсточникЗначение("URL")
Процедура ТестДолжен_ВернутьIDNХостДляМеждународногоДомена(ИмяТипа) Экспорт

	// Подготовка
	Если ИмяТипа = "URI" Тогда
		Адрес = Новый URI("https://пример.рф/");
	Иначе
		Адрес = Новый URL("https://пример.рф/");
	КонецЕсли;

	// Действие
	Результат = Адрес.IDNХост();

	// Проверка
	Ожидаем.Что(Результат).Равно("xn--e1afmkfd.xn--p1ai");

КонецПроцедуры

&ПараметризованныйТест
&ИсточникЗначение("https://EXAMPLE.com/", "example.com")
&ИсточникЗначение("https://xn--e1afmkfd.xn--p1ai/", "xn--e1afmkfd.xn--p1ai")
&ИсточникЗначение("https://xn--invalid-/", "xn--invalid-")
&ИсточникЗначение(
	"https://xn--e1afmkfd.xn--invalid-/",
	"xn--e1afmkfd.xn--invalid-"
)
&ИсточникЗначение("https://192.0.2.1/", "192.0.2.1")
&ИсточникЗначение("https://[2001:db8::1]/", "[2001:db8::1]")
&ИсточникЗначение("x://[v1.a]/", "[v1.a]")
Процедура ТестДолжен_ВернутьIDNХостДляРазныхВидовХоста(Значение, ОжидаемыйХост) Экспорт

	// Подготовка
	Адрес = Новый URI(Значение);

	// Действие
	Результат = Адрес.IDNХост();

	// Проверка
	Ожидаем.Что(Результат).Равно(ОжидаемыйХост);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ВернутьНеопределеноДляURIБезХоста() Экспорт

	// Подготовка
	Адрес = Новый URI("/path");

	// Действие
	Результат = Адрес.IDNХост();

	// Проверка
	Ожидаем.Что(Результат).Равно(Неопределено);

КонецПроцедуры

#КонецОбласти
