#Использовать asserts
#Использовать "../../src"

#Область Тесты

&Тест
Процедура ТестДолжен_СравниватьЛексическоеИGenericРавенство() Экспорт

	// Подготовка
	Первый = Новый URI("/a%2f");
	Второй = Новый URI("/a%2F");

	// Действие и Проверка
	Ожидаем.Что(Первый.Равно(Второй)).ЭтоЛожь();
	Ожидаем.Что(Первый.Эквивалентен(Второй)).ЭтоИстина();

КонецПроцедуры

&Тест
Процедура ТестДолжен_СравниватьЭквивалентностьПослеGenericНормализации() Экспорт

	// Подготовка
	Первый = Новый URI("HTTP://Example.COM/a/../b");
	Второй = Новый URI("http://example.com/b");

	// Действие и Проверка
	Ожидаем.Что(Первый.Эквивалентен(Второй)).ЭтоИстина();

КонецПроцедуры

&Тест
Процедура ТестДолжен_СравниватьЭквивалентностьДляСхемы() Экспорт

	// Подготовка
	Первый = Новый URI("http://example.com");
	Второй = Новый URI("http://example.com:80/");

	// Действие и Проверка
	Ожидаем.Что(Первый.Равно(Второй)).ЭтоЛожь();
	Ожидаем.Что(Первый.Эквивалентен(Второй)).ЭтоЛожь();
	Ожидаем.Что(Первый.ЭквивалентенДляСхемы(Второй)).ЭтоИстина();

КонецПроцедуры

&Тест
Процедура ТестДолжен_ОбеспечиватьСвойстваЭквивалентности() Экспорт

	// Подготовка
	Первый = Новый URI("HTTP://EXAMPLE.COM/%7e");
	Второй = Новый URI("http://example.com/~");
	Третий = Новый URI("http://example.com/%7E");

	// Действие и Проверка
	Ожидаем.Что(Первый.Эквивалентен(Первый)).ЭтоИстина();
	Ожидаем.Что(Первый.Эквивалентен(Второй)).Равно(Второй.Эквивалентен(Первый));
	Ожидаем.Что(Первый.Эквивалентен(Второй) И Второй.Эквивалентен(Третий)).ЭтоИстина();
	Ожидаем.Что(Первый.Эквивалентен(Третий)).ЭтоИстина();

КонецПроцедуры

#КонецОбласти
