#Область СлужебныйПрограммныйИнтерфейс

// Возвращает вид хоста URI, представленного зарегистрированным именем.
//
// Возвращаемое значение:
//  Строка - Вид хоста URI.
Функция РегИмя() Экспорт

	Возврат "RegName";

КонецФункции

// Возвращает вид хоста URI, представленного IPv4-адресом.
//
// Возвращаемое значение:
//  Строка - Вид хоста URI.
Функция IPv4() Экспорт

	Возврат "IPv4";

КонецФункции

// Возвращает вид хоста URI, представленного IPv6-адресом.
//
// Возвращаемое значение:
//  Строка - Вид хоста URI.
Функция IPv6() Экспорт

	Возврат "IPv6";

КонецФункции

// Возвращает вид хоста URI, представленного IPvFuture-адресом.
//
// Возвращаемое значение:
//  Строка - Вид хоста URI.
Функция IPvFuture() Экспорт

	Возврат "IPvFuture";

КонецФункции

#КонецОбласти
