#Использовать asserts
#Использовать "../../src"

#Область Тесты

&ПараметризованныйТест
&ИсточникЗначение("http://192.0.2.1/", 4, "192.0.2.1")
&ИсточникЗначение("http://[2001:0DB8:0:0::1]/", 6, "2001:db8::1")
&ИсточникЗначение("http://[::ffff:127.0.0.1]/", 6, "::ffff:127.0.0.1")
Процедура ТестДолжен_ВернутьIPАдресХоста(СтрокаАдреса, Версия, Представление) Экспорт

	// Подготовка
	Адрес = Новый URL(СтрокаАдреса);

	// Действие
	Результат = Адрес.IPАдресХоста();

	// Проверка
	Ожидаем.Что(ТипЗнч(Результат)).Равно(Тип("IPАдрес"));
	Ожидаем.Что(Результат.Версия()).Равно(Версия);
	Ожидаем.Что(Результат.ВСтроку()).Равно(Представление);

КонецПроцедуры

&ПараметризованныйТест
&ИсточникЗначение("http://example.com/")
&ИсточникЗначение("http://127%2E0%2E0%2E1/")
&ИсточникЗначение("http://01.2.3.4/")
&ИсточникЗначение("x://[v1.example]/")
&ИсточникЗначение("//")
&ИсточникЗначение("path")
Процедура ТестДолжен_ВернутьНеопределеноДляХостаБезIPАдреса(СтрокаАдреса) Экспорт

	// Подготовка
	Адрес = Новый URL(СтрокаАдреса);

	// Действие
	Результат = Адрес.IPАдресХоста();

	// Проверка
	Ожидаем.Что(Результат).Равно(Неопределено);

КонецПроцедуры

#КонецОбласти
