#Использовать asserts
#Использовать "../../src"

#Область Тесты

&ПараметризованныйТест
&ИсточникЗначение("https://example.com/", "RegName")
&ИсточникЗначение("https://127.0.0.1/", "IPv4")
&ИсточникЗначение("https://[2001:db8::1]/", "IPv6")
&ИсточникЗначение("x://[v1.example]/", "IPvFuture")
Процедура ТестДолжен_ВернутьПубличныйВидХоста(Значение, ОжидаемыйВид) Экспорт

	// Подготовка
	Адрес = Новый URL(Значение);

	// Действие и Проверка
	Ожидаем.Что(Адрес.ВидХоста()).Равно(ОжидаемыйВид);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ДелегироватьВидХостаURL() Экспорт

	// Подготовка
	Адрес = Новый URL("https://[2001:db8::1]/");

	// Действие и Проверка
	Ожидаем.Что(Адрес.ВидХоста()).Равно(ВидыХостаURL.IPv6());

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПредоставитьКонстантыВидовХоста() Экспорт

	// Действие и Проверка
	Ожидаем.Что(ВидыХостаURL.ЗарегистрированноеИмя()).Равно("RegName");
	Ожидаем.Что(ВидыХостаURL.IPv4()).Равно("IPv4");
	Ожидаем.Что(ВидыХостаURL.IPv6()).Равно("IPv6");
	Ожидаем.Что(ВидыХостаURL.IPvFuture()).Равно("IPvFuture");

КонецПроцедуры

&Тест
Процедура ТестДолжен_РазличитьОтсутствующийИПустойХост() Экспорт

	// Подготовка
	БезСервернойЧасти = Новый URL("path");
	СПустойСервернойЧастью = Новый URL("//");

	// Действие и Проверка
	Ожидаем.Что(БезСервернойЧасти.ВидХоста()).Равно(Неопределено);
	Ожидаем.Что(СПустойСервернойЧастью.ВидХоста()).Равно(ВидыХостаURL.ЗарегистрированноеИмя());

КонецПроцедуры

#КонецОбласти
