#Использовать asserts
#Использовать errors
#Использовать "../../src"
#Использовать "../fixtures"

Перем _Адрес; // URL
Перем _Значение; // Произвольный

#Область Тесты

&Тест
Процедура ТестДолжен_КодироватьДекодированныеДанныеПользователя() Экспорт

	// Подготовка
	Адрес = Новый URL("https://host/a");

	// Действие
	Результат = Адрес.УстановитьДанныеПользователя("user@example:pass word");

	// Проверка
	Ожидаем.Что(Результат).Идентично(Адрес);
	Ожидаем.Что(Адрес.ВСтроку()).Равно("https://user%40example:pass%20word@host/a");

КонецПроцедуры

&Тест
Процедура ТестДолжен_СохранитьИсходноеНаписаниеКодированныхДанныхПользователя() Экспорт

	// Подготовка
	Адрес = Новый URL("https://host/a");

	// Действие
	Адрес.УстановитьКодированныеДанныеПользователя("u%73er:p%40ss");

	// Проверка
	Ожидаем.Что(Адрес.ВСтроку()).Равно("https://u%73er:p%40ss@host/a");

КонецПроцедуры

&Тест
Процедура ТестДолжен_АвтоматическиСоздатьСервернуюЧастьДляДанныхПользователя() Экспорт

	// Подготовка
	Адрес = Новый URL("x:/a");

	// Действие
	Адрес.УстановитьДанныеПользователя("user");

	// Проверка
	Ожидаем.Что(Адрес.ВСтроку()).Равно("x://user@/a");

КонецПроцедуры

&Тест
Процедура ТестДолжен_НеСоздатьСервернуюЧастьПриУдаленииДанныхПользователя() Экспорт

	// Подготовка
	Адрес = Новый URL("x:/a");

	// Действие
	Адрес.УстановитьДанныеПользователя(Неопределено);

	// Проверка
	Ожидаем.Что(Адрес.ВСтроку()).Равно("x:/a");

КонецПроцедуры

&Тест
Процедура ТестДолжен_АтомарноОтклонитьНедопустимыеКодированныеДанныеПользователя() Экспорт

	// Подготовка
	Адрес = Новый URL("https://old:pass@host/a");
	_Адрес = Адрес;
	_Значение = "new@name";
	ИсходнаяСтрока = Адрес.ВСтроку();

	// Действие
	ПомощникТестированияURL.ПроверитьКодОшибки(
		Новый Действие(ЭтотОбъект, "УстановитьКодированныеДанныеПользователяДляТеста"),
		"url.invalid_authority"
	);

	// Проверка
	Ожидаем.Что(Адрес.ВСтроку()).Равно(ИсходнаяСтрока);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьКодированныеДанныеПользователяДляТеста() Экспорт

	_Адрес.УстановитьКодированныеДанныеПользователя(_Значение);

КонецПроцедуры

#КонецОбласти
