#Использовать asserts
#Использовать "../../src"

#Область Тесты

&Тест
Процедура ТестДолжен_СоздатьНеизменяемыйСнимокСоИсходнымНаписаниемЗапроса() Экспорт

	// Подготовка
	Адрес = Новый URL("https://example.com/a?x=%2f");

	// Действие
	Снимок = Адрес.URI();

	// Проверка
	Ожидаем.Что(Строка(ТипЗнч(Снимок))).Равно("URI");
	Ожидаем.Что(Снимок.ВСтроку()).Равно("https://example.com/a?x=%2f");

КонецПроцедуры

&Тест
Процедура ТестДолжен_СоздатьНезависимыйURIИзURL() Экспорт

	// Подготовка
	Адрес = Новый URL("https://example.com/a?x=%2f");
	Снимок = Адрес.URI();

	// Действие
	УриИзURL = Новый URI(Адрес);

	// Проверка
	Ожидаем.Что(Строка(ТипЗнч(УриИзURL))).Равно("URI");
	Ожидаем.Что(УриИзURL.ВСтроку()).Равно("https://example.com/a?x=%2f");
	Ожидаем.Что(УриИзURL).ЭтоНе().Идентично(Снимок);

КонецПроцедуры

&Тест
Процедура ТестДолжен_СоздатьНезависимуюКопиюURLСоИсходнымНаписаниемЗапроса() Экспорт

	// Подготовка
	Адрес = Новый URL("https://example.com/a?x=%2f");

	// Действие
	Копия = Адрес.Скопировать();

	// Проверка
	Ожидаем.Что(Строка(ТипЗнч(Копия))).Равно("URL");
	Ожидаем.Что(Копия.ВСтроку()).Равно("https://example.com/a?x=%2f");
	Ожидаем.Что(Копия).ЭтоНе().Идентично(Адрес);
	Ожидаем.Что(Копия.URI()).ЭтоНе().Идентично(Адрес.URI());

КонецПроцедуры

&Тест
Процедура ТестДолжен_ВернутьПредписанныеТипыПреобразований() Экспорт

	// Подготовка
	Адрес = Новый URL("HTTP://Example.COM/a/../b");

	// Действие
	Разрешенный = Адрес.Разрешить("c");
	Относительный = Адрес.СделатьОтносительным("http://example.com/b/c");
	Нормализованный = Адрес.Нормализованный();
	НормализованныйДляСхемы = Адрес.НормализованныйДляСхемы();

	// Проверка
	Ожидаем.Что(Строка(ТипЗнч(Разрешенный))).Равно("URL");
	Ожидаем.Что(Строка(ТипЗнч(Относительный))).Равно("URI");
	Ожидаем.Что(Строка(ТипЗнч(Нормализованный))).Равно("URL");
	Ожидаем.Что(Строка(ТипЗнч(НормализованныйДляСхемы))).Равно("URL");
	Ожидаем.Что(Разрешенный.ВСтроку()).Равно("HTTP://Example.COM/c");
	Ожидаем.Что(Относительный.ВСтроку()).Равно("b/c");
	Ожидаем.Что(Нормализованный.ВСтроку()).Равно("http://example.com/b");
	Ожидаем.Что(НормализованныйДляСхемы.ВСтроку()).Равно("http://example.com/b");

КонецПроцедуры

&Тест
Процедура ТестДолжен_СравнитьСURIИURL() Экспорт

	// Подготовка
	Адрес = Новый URL("HTTP://EXAMPLE.COM/%7e");
	Ури = Новый URI("http://example.com/~");
	ДругойАдрес = Новый URL("http://example.com/~");

	// Действие и Проверка
	Ожидаем.Что(Адрес.Равно(Ури)).ЭтоЛожь();
	Ожидаем.Что(Адрес.Эквивалентен(ДругойАдрес)).ЭтоИстина();
	Ожидаем.Что(Адрес.ЭквивалентенДляСхемы(Ури)).ЭтоИстина();

КонецПроцедуры

#КонецОбласти
