#Использовать asserts
#Использовать "../../src"

#Область Тесты

&ПараметризованныйТест
&ИсточникЗначение("http://example.com/", Истина)
&ИсточникЗначение("https://example.com:65535/", Истина)
&ИсточникЗначение("http:/path", Ложь)
&ИсточникЗначение("http:///path", Ложь)
&ИсточникЗначение("http://example.com:65536/", Ложь)
&ИсточникЗначение("ws://example.com/socket", Истина)
&ИсточникЗначение("ws://user@example.com/socket", Ложь)
&ИсточникЗначение("wss://example.com/socket#fragment", Ложь)
&ИсточникЗначение("ftp://user@example.com/path", Истина)
&ИсточникЗначение("x:a", Истина)
&ИсточникЗначение("relative/path", Истина)
Процедура ТестДолжен_ПроверитьОграниченияКонкретнойСхемы(Значение, ОжидаемыйРезультат) Экспорт

	// Подготовка
	Адрес = Новый URL(Значение);

	// Действие
	Результат = Адрес.СоответствуетСхеме();

	// Проверка
	Ожидаем.Что(Результат).Равно(ОжидаемыйРезультат);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ДелегироватьПроверкуСхемыURL() Экспорт

	// Подготовка
	Адрес = Новый URL("http:/path");

	// Действие и Проверка
	Ожидаем.Что(Адрес.СоответствуетСхеме()).ЭтоЛожь();

КонецПроцедуры

#КонецОбласти
