#Использовать asserts
#Использовать "../../src"

#Область Тесты

&Тест
Процедура ТестДолжен_СравниватьЛексическоеИОбщееРавенство() Экспорт

	// Подготовка
	Первый = Новый URL("/a%2f");
	Второй = Новый URL("/a%2F");

	// Действие и Проверка
	Ожидаем.Что(Первый.Равен(Второй)).ЭтоЛожь();
	Ожидаем.Что(Первый.Эквивалентен(Второй)).ЭтоИстина();

КонецПроцедуры

&Тест
Процедура ТестДолжен_СравниватьЭквивалентностьПослеОбщейНормализации() Экспорт

	// Подготовка
	Первый = Новый URL("HTTP://Example.COM/a/../b");
	Второй = Новый URL("http://example.com/b");

	// Действие и Проверка
	Ожидаем.Что(Первый.Эквивалентен(Второй)).ЭтоИстина();

КонецПроцедуры

&Тест
Процедура ТестДолжен_СравниватьЭквивалентностьДляСхемы() Экспорт

	// Подготовка
	Первый = Новый URL("http://example.com");
	Второй = Новый URL("http://example.com:80/");

	// Действие и Проверка
	Ожидаем.Что(Первый.Равен(Второй)).ЭтоЛожь();
	Ожидаем.Что(Первый.Эквивалентен(Второй)).ЭтоЛожь();
	Ожидаем.Что(Первый.ЭквивалентенДляСхемы(Второй)).ЭтоИстина();

КонецПроцедуры

&Тест
Процедура ТестДолжен_ОбеспечиватьСвойстваЭквивалентности() Экспорт

	// Подготовка
	Первый = Новый URL("HTTP://EXAMPLE.COM/%7e");
	Второй = Новый URL("http://example.com/~");
	Третий = Новый URL("http://example.com/%7E");

	// Действие и Проверка
	Ожидаем.Что(Первый.Эквивалентен(Первый)).ЭтоИстина();
	Ожидаем.Что(Первый.Эквивалентен(Второй)).Равно(Второй.Эквивалентен(Первый));
	Ожидаем.Что(Первый.Эквивалентен(Второй) И Второй.Эквивалентен(Третий)).ЭтоИстина();
	Ожидаем.Что(Первый.Эквивалентен(Третий)).ЭтоИстина();

КонецПроцедуры

#КонецОбласти
