#Использовать asserts
#Использовать errors

#Область ПрограммныйИнтерфейс

// Проверяет машинный код исключения, выбрасываемого действием.
//
// Параметры:
//  Действие - Действие - Действие, выбрасывающее проверяемое исключение.
//  ОжидаемыйКод - Строка - Ожидаемый машинный код ошибки.
Процедура ПроверитьКодОшибки(Действие, ОжидаемыйКод) Экспорт

	Попытка
		Действие.Выполнить();
	Исключение
		Ожидаем.Что(ДиагностикаОшибок.КодОшибки(ИнформацияОбОшибке())).Равно(ОжидаемыйКод);
		Возврат;
	КонецПопытки;

	ВызватьИсключение "Ожидалось исключение с кодом " + ОжидаемыйКод;

КонецПроцедуры

#КонецОбласти
