#Использовать asserts
#Использовать "../../src"
#Использовать "../fixtures"

Перем _НедопустимыйДомен; // Строка

#Область Тесты

&ПараметризованныйТест
&ИсточникЗначение("", "")
&ИсточникЗначение("EXAMPLE.COM", "example.com")
&ИсточникЗначение("пример.рф", "xn--e1afmkfd.xn--p1ai")
&ИсточникЗначение("BÜCHER.de", "xn--bcher-kva.de")
&ИсточникЗначение("faß.de", "xn--fa-hia.de")
&ИсточникЗначение("example。com", "example.com")
&ИсточникЗначение("example.com.", "example.com.")
Процедура ТестДолжен_КодироватьДоменПоUTS46(Домен, ОжидаемоеЗначение) Экспорт

	// Действие
	Результат = СервисыБиблиотекиURL.ПреобразовательДоменов().Кодировать(Домен);

	// Проверка
	Ожидаем.Что(Результат).Равно(ОжидаемоеЗначение);

КонецПроцедуры

&ПараметризованныйТест
&ИсточникЗначение("xn--invalid-")
Процедура ТестДолжен_ОтклонитьНедопустимуюСтруктуруДоменаПриКодировании(Домен) Экспорт

	// Подготовка
	_НедопустимыйДомен = Домен;

	// Действие и Проверка
	ПомощникТестированияURL.ПроверитьКодОшибки(
		Новый Действие(ЭтотОбъект, "КодироватьНедопустимыйДомен"),
		"argument.invalid_value"
	);

КонецПроцедуры

&Тест
Процедура ТестДолжен_НеПроверятьОграниченияДлиныDNSПриКодировании() Экспорт

	// Подготовка
	Метка63 = "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa";
	Метка62 = "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa";
	Домен = Метка63 + "." + Метка63 + "." + Метка63 + "." + Метка62;

	// Действие
	Результат = СервисыБиблиотекиURL.ПреобразовательДоменов().Кодировать(Домен);

	// Проверка
	Ожидаем.Что(Результат).Равно(Домен);

КонецПроцедуры

&Тест
Процедура ТестДолжен_НормализоватьДоменПередКодированием() Экспорт

	// Подготовка
	Домен = "bu" + Символ(776) + "cher.de";

	// Действие
	Результат = СервисыБиблиотекиURL.ПреобразовательДоменов().Кодировать(Домен);

	// Проверка
	Ожидаем.Что(Результат).Равно("xn--bcher-kva.de");

КонецПроцедуры

&ПараметризованныйТест
&ИсточникЗначение("", "")
&ИсточникЗначение("example.com", "example.com")
&ИсточникЗначение("xn--e1afmkfd.xn--p1ai", "пример.рф")
&ИсточникЗначение("xn--bcher-kva.de", "bücher.de")
&ИсточникЗначение("xn--fa-hia.de", "faß.de")
Процедура ТестДолжен_ДекодироватьДоменПоUTS46(Домен, ОжидаемоеЗначение) Экспорт

	// Действие
	Результат = СервисыБиблиотекиURL.ПреобразовательДоменов().Декодировать(Домен);

	// Проверка
	Ожидаем.Что(Результат).Равно(ОжидаемоеЗначение);

КонецПроцедуры

&Тест
Процедура ТестДолжен_СохранитьНекорректнуюAMеткуПриДекодировании() Экспорт

	// Действие
	Результат = СервисыБиблиотекиURL.ПреобразовательДоменов().Декодировать("xn--invalid-");

	// Проверка
	Ожидаем.Что(Результат).Равно("xn--invalid-");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура КодироватьНедопустимыйДомен() Экспорт

	СервисыБиблиотекиURL.ПреобразовательДоменов().Кодировать(_НедопустимыйДомен);

КонецПроцедуры

#КонецОбласти
