#Область ПрограммныйИнтерфейс

// Возвращает вид хоста URL, представленного зарегистрированным именем.
//
// Возвращаемое значение:
//  Строка - Вид хоста URL.
Функция ЗарегистрированноеИмя() Экспорт

	Возврат "RegName";

КонецФункции

// Возвращает вид хоста URL, представленного IPv4-адресом.
//
// Возвращаемое значение:
//  Строка - Вид хоста URL.
Функция IPv4() Экспорт

	Возврат "IPv4";

КонецФункции

// Возвращает вид хоста URL, представленного IPv6-адресом.
//
// Возвращаемое значение:
//  Строка - Вид хоста URL.
Функция IPv6() Экспорт

	Возврат "IPv6";

КонецФункции

// Возвращает вид хоста URL, представленного IPvFuture-адресом.
//
// Возвращаемое значение:
//  Строка - Вид хоста URL.
Функция IPvFuture() Экспорт

	Возврат "IPvFuture";

КонецФункции

#КонецОбласти
