#Использовать asserts
#Использовать "../../src"
#Использовать "../../src/internal"

#Область Тесты

&Тест
Процедура ТестДолжен_ВернутьНезависимыйНормализованныйURL() Экспорт

	// Подготовка
	Исходный = Новый URL("HTTP://Example.COM/a/../b%7e");

	// Действие
	Результат = СервисыБиблиотекиURL.НормализаторURI().Нормализовать(Исходный);
	Исходный.УстановитьПуть("/changed");

	// Проверка
	Ожидаем.Что(ТипЗнч(Результат)).Равно(Тип("URL"));
	Ожидаем.Что(Результат.ВСтроку()).Равно("http://example.com/b~");

КонецПроцедуры

#КонецОбласти
