#Использовать asserts
#Использовать "../../src"
#Использовать "../../src/internal"

#Область Тесты

&Тест
Процедура ТестДолжен_РазрешитьОбъектыURL() Экспорт

	// Подготовка
	База = Новый URL("http://a/b/c/d;p?q");
	Ссылка = Новый URL("../g");

	// Действие
	Результат = Новый РазрешительURI().Разрешить(База, Ссылка);
	База.УстановитьПуть("/changed");
	Ссылка.УстановитьПуть("other");

	// Проверка
	Ожидаем.Что(ТипЗнч(Результат)).Равно(Тип("URL"));
	Ожидаем.Что(Результат.ВСтроку()).Равно("http://a/b/g");
	Ожидаем.Что(Результат).ЭтоНе().Идентично(База);

КонецПроцедуры

#КонецОбласти
