#Использовать asserts
#Использовать "../../src"
#Использовать "../../src/internal"

#Область Тесты

&Тест
Процедура ТестДолжен_ВернутьВременныеКомпонентыURL() Экспорт

	// Подготовка
	Парсер = СервисыБиблиотекиURL.ПарсерIRI();

	// Действие
	Компоненты = Парсер.Разобрать("https://example.com/path?");

	// Проверка
	Ожидаем.Что(ТипЗнч(Компоненты)).Равно(Тип("Структура"));
	Ожидаем.Что(Компоненты.Схема).Равно("https");
	Ожидаем.Что(Компоненты.КодированныйХост).Равно("example.com");
	Ожидаем.Что(Компоненты.КодированныйПуть).Равно("/path");
	Ожидаем.Что(Компоненты.ЗапросОпределен).Равно(Истина);
	Ожидаем.Что(Компоненты.КодированныйЗапрос).Равно("");

КонецПроцедуры

#КонецОбласти
