#Использовать asserts
#Использовать "../../src"
#Использовать "../../src/internal"

#Область Тесты

&Тест
Процедура ТестДолжен_РелятивизироватьОбъектыURL() Экспорт

	// Подготовка
	База = Новый URL("http://e/a/");
	Цель = Новый URL("http://e/a/b");

	// Действие
	Результат = СервисыБиблиотекиURL.РелятивизаторURI().СделатьОтносительным(База, Цель);
	База.УстановитьПуть("/changed/");
	Цель.УстановитьПуть("/other");

	// Проверка
	Ожидаем.Что(Результат).ИмеетТип("URL");
	Ожидаем.Что(Результат.ВСтроку()).Равно("b");

КонецПроцедуры

#КонецОбласти
