#Использовать asserts
#Использовать "../../src"
#Использовать "../../src/internal"

Перем _БлокировкаСтарта; // БлокировкаРесурса
Перем _КоличествоГотовых; // Число
Перем _НачатьПроверку; // Булево
Перем _Экземпляры; // Массив из СравнивательURL

#Область ОбработчикиСобытий

&ТестовыйНабор(Характер = "Одиночка")
Процедура ПриСозданииОбъекта() Экспорт

КонецПроцедуры

#КонецОбласти

#Область Тесты

&Тест
Процедура ТестДолжен_ПотокобезопасноСоздаватьОдиночныйЭкземплярСервиса() Экспорт

	// Подготовка
	КоличествоЗаданий = 12;
	_БлокировкаСтарта = Новый БлокировкаРесурса;
	_КоличествоГотовых = 0;
	_НачатьПроверку = Ложь;
	_Экземпляры = Новый Массив;

	Менеджер = Новый МенеджерФоновыхЗаданий;
	Для НомерЗадания = 0 По КоличествоЗаданий - 1 Цикл
		_Экземпляры.Добавить(Неопределено);
		Параметры = Новый Массив;
		Параметры.Добавить(НомерЗадания);
		Менеджер.Выполнить(ЭтотОбъект, "ПолучитьСервисВПотоке", Параметры, Истина);
	КонецЦикла;

	ДождатьсяГотовностиЗаданий(КоличествоЗаданий);

	// Действие
	РазрешитьПроверку();
	Менеджер.ОжидатьЗавершенияЗадач();

	// Проверка
	Для Индекс = 1 По КоличествоЗаданий - 1 Цикл
		ПроверитьОдиночныйЭкземпляр(_Экземпляры[0], _Экземпляры[Индекс]);
	КонецЦикла;

КонецПроцедуры

&Тест
Процедура ТестДолжен_ВозвращатьОдиночныеЭкземплярыВнутреннихСервисов() Экспорт

	// Действие и Проверка
	ПроверитьОдиночныйЭкземпляр(
		СервисыБиблиотекиURL.КодировщикКомпонентовURI(),
		СервисыБиблиотекиURL.КодировщикКомпонентовURI()
	);
	ПроверитьОдиночныйЭкземпляр(
		СервисыБиблиотекиURL.ПреобразовательКодовыхТочекUnicode(),
		СервисыБиблиотекиURL.ПреобразовательКодовыхТочекUnicode()
	);
	ПроверитьОдиночныйЭкземпляр(
		СервисыБиблиотекиURL.НормализаторСтрокUnicode(),
		СервисыБиблиотекиURL.НормализаторСтрокUnicode()
	);
	ПроверитьОдиночныйЭкземпляр(
		СервисыБиблиотекиURL.ПреобразовательДоменов(),
		СервисыБиблиотекиURL.ПреобразовательДоменов()
	);
	ПроверитьОдиночныйЭкземпляр(
		СервисыБиблиотекиURL.РазборщикКомпонентовURL(),
		СервисыБиблиотекиURL.РазборщикКомпонентовURL()
	);
	ПроверитьОдиночныйЭкземпляр(
		СервисыБиблиотекиURL.ПроверяющийСинтаксисURI(),
		СервисыБиблиотекиURL.ПроверяющийСинтаксисURI()
	);
	ПроверитьОдиночныйЭкземпляр(
		СервисыБиблиотекиURL.КлассификаторХостаURI(),
		СервисыБиблиотекиURL.КлассификаторХостаURI()
	);
	ПроверитьОдиночныйЭкземпляр(
		СервисыБиблиотекиURL.КодировщикPunycode(),
		СервисыБиблиотекиURL.КодировщикPunycode()
	);
	ПроверитьОдиночныйЭкземпляр(
		СервисыБиблиотекиURL.КодировщикКомпонентаIRI(),
		СервисыБиблиотекиURL.КодировщикКомпонентаIRI()
	);
	ПроверитьОдиночныйЭкземпляр(
		СервисыБиблиотекиURL.НормализаторURI(),
		СервисыБиблиотекиURL.НормализаторURI()
	);
	ПроверитьОдиночныйЭкземпляр(
		СервисыБиблиотекиURL.ОпределительСтандартногоПортаURI(),
		СервисыБиблиотекиURL.ОпределительСтандартногоПортаURI()
	);
	ПроверитьОдиночныйЭкземпляр(
		СервисыБиблиотекиURL.ПарсерIRI(),
		СервисыБиблиотекиURL.ПарсерIRI()
	);
	ПроверитьОдиночныйЭкземпляр(
		СервисыБиблиотекиURL.ПроверяющийСхемыURL(),
		СервисыБиблиотекиURL.ПроверяющийСхемыURL()
	);
	ПроверитьОдиночныйЭкземпляр(
		СервисыБиблиотекиURL.РазрешительURI(),
		СервисыБиблиотекиURL.РазрешительURI()
	);
	ПроверитьОдиночныйЭкземпляр(
		СервисыБиблиотекиURL.РелятивизаторURI(),
		СервисыБиблиотекиURL.РелятивизаторURI()
	);
	ПроверитьОдиночныйЭкземпляр(
		СервисыБиблиотекиURL.СборщикURL(),
		СервисыБиблиотекиURL.СборщикURL()
	);
	ПроверитьОдиночныйЭкземпляр(
		СервисыБиблиотекиURL.СравнивательURL(),
		СервисыБиблиотекиURL.СравнивательURL()
	);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПолучитьСервисВПотоке(НомерЗадания) Экспорт

	СообщитьОГотовности();
	ДождатьсяРазрешенияПроверки();

	Экземпляр = СервисыБиблиотекиURL.СравнивательURL();

	_БлокировкаСтарта.Заблокировать();
	_Экземпляры[НомерЗадания] = Экземпляр;
	_БлокировкаСтарта.Разблокировать();

КонецПроцедуры

Процедура ДождатьсяГотовностиЗаданий(КоличествоЗаданий)

	Для НомерПопытки = 1 По 10000 Цикл
		_БлокировкаСтарта.Заблокировать();
		ВсеГотовы = _КоличествоГотовых = КоличествоЗаданий;
		_БлокировкаСтарта.Разблокировать();

		Если ВсеГотовы Тогда
			Возврат;
		КонецЕсли;

		Приостановить(1);
	КонецЦикла;

	ВызватьИсключение "Не все фоновые задания подготовились к проверке";

КонецПроцедуры

Процедура СообщитьОГотовности()

	_БлокировкаСтарта.Заблокировать();
	_КоличествоГотовых = _КоличествоГотовых + 1;
	_БлокировкаСтарта.Разблокировать();

КонецПроцедуры

Процедура ДождатьсяРазрешенияПроверки()

	Пока Истина Цикл
		_БлокировкаСтарта.Заблокировать();
		НачатьПроверку = _НачатьПроверку;
		_БлокировкаСтарта.Разблокировать();

		Если НачатьПроверку Тогда
			Возврат;
		КонецЕсли;

		Приостановить(1);
	КонецЦикла;

КонецПроцедуры

Процедура РазрешитьПроверку()

	_БлокировкаСтарта.Заблокировать();
	_НачатьПроверку = Истина;
	_БлокировкаСтарта.Разблокировать();

КонецПроцедуры

Процедура ПроверитьОдиночныйЭкземпляр(Первый, Второй)

	Ожидаем.Что(Первый = Второй).Равно(Истина);

КонецПроцедуры

#КонецОбласти
