#Использовать asserts
#Использовать "../../src"
#Использовать "../../src/internal"

#Область Тесты

&ПараметризованныйТест
&ИсточникЗначение("http", 80)
&ИсточникЗначение("HTTP", 80)
&ИсточникЗначение("ws", 80)
&ИсточникЗначение("https", 443)
&ИсточникЗначение("wss", 443)
&ИсточникЗначение("ftp", 21)
&ИсточникЗначение("unknown", Неопределено)
&ИсточникЗначение(Неопределено, Неопределено)
Процедура ТестДолжен_ОпределитьСтандартныйПортURI(Схема, ОжидаемыйПорт) Экспорт

	// Подготовка
	Определитель = Новый ОпределительСтандартногоПортаURI;

	// Действие
	Порт = Определитель.Определить(Схема);

	// Проверка
	Ожидаем.Что(Порт).Равно(ОжидаемыйПорт);

КонецПроцедуры

#КонецОбласти
