#Использовать asserts
#Использовать "../../src"

#Область Тесты

&Тест
Процедура ТестДолжен_ЭкспортироватьСтабильныеКоды() Экспорт

	// Действие и Проверка
	Ожидаем.Что(КодыОшибокURL.НедопустимыйСинтаксисURI()).Равно("uri.invalid_syntax");
	Ожидаем.Что(КодыОшибокURL.НедопустимаяСхемаURI()).Равно("uri.invalid_scheme");
	Ожидаем.Что(КодыОшибокURL.НедопустимоеПроцентноеКодированиеURI())
		.Равно("uri.invalid_percent_encoding");
	Ожидаем.Что(КодыОшибокURL.НедопустимаяСервернаяЧастьURI()).Равно("uri.invalid_authority");
	Ожидаем.Что(КодыОшибокURL.НедопустимыйХостURI()).Равно("uri.invalid_host");
	Ожидаем.Что(КодыОшибокURL.НедопустимыйIPv6()).Равно("uri.invalid_ipv6");
	Ожидаем.Что(КодыОшибокURL.НедопустимыйIPvFuture()).Равно("uri.invalid_ipvfuture");
	Ожидаем.Что(КодыОшибокURL.БазаURIНеАбсолютная()).Равно("uri.base_not_absolute");
	Ожидаем.Что(КодыОшибокURL.ОтносительныйURLБезБазы()).Равно("url.relative_without_base");
	Ожидаем.Что(КодыОшибокURL.БазаURLНеАбсолютная()).Равно("url.base_not_absolute");
	Ожидаем.Что(КодыОшибокURL.НесовместимыеКомпонентыURL()).Равно("url.incompatible_components");
	Ожидаем.Что(КодыОшибокURL.НедопустимыйКомпонентURL()).Равно("url.invalid_component");
	Ожидаем.Что(КодыОшибокURL.ПереполнениеЧисловогоПорта()).Равно("url.port.numeric_overflow");

КонецПроцедуры

#КонецОбласти
