#Использовать asserts
#Использовать "../../src"

#Область Тесты

&Тест
Процедура ТестДолжен_ЭкспортироватьСтабильныеКоды() Экспорт

	// Действие и Проверка
	Ожидаем.Что(КодыОшибокURL.НедопустимыйСинтаксис()).Равно("url.invalid_syntax");
	Ожидаем.Что(КодыОшибокURL.НедопустимаяСхема()).Равно("url.invalid_scheme");
	Ожидаем.Что(КодыОшибокURL.НедопустимоеПроцентноеКодирование())
		.Равно("url.invalid_percent_encoding");
	Ожидаем.Что(КодыОшибокURL.НедопустимаяСервернаяЧасть()).Равно("url.invalid_authority");
	Ожидаем.Что(КодыОшибокURL.НедопустимыйХост()).Равно("url.invalid_host");
	Ожидаем.Что(КодыОшибокURL.БазаНеАбсолютная()).Равно("url.base_not_absolute");
	Ожидаем.Что(КодыОшибокURL.НесовместимыеКомпоненты()).Равно("url.incompatible_components");
	Ожидаем.Что(КодыОшибокURL.ПереполнениеЧисловогоПорта()).Равно("url.port.numeric_overflow");
	Ожидаем.Что(КодыОшибокURL.НедопустимыйДляСхемы()).Равно("url.invalid_for_scheme");
	Ожидаем.Что(КодыОшибокURL.НедопустимыеДанныеIDNA()).Равно("idna.data.invalid");

КонецПроцедуры

#КонецОбласти
