#Использовать asserts
#Использовать "../../src"

#Область Тесты

&Тест
Процедура ТестДолжен_РаскрытьВсеОператорыRFC6570() Экспорт

	// Подготовка
	Значения = Новый Соответствие;
	Значения.Вставить("var", "value");
	Значения.Вставить("hello", "Hello World!");
	Значения.Вставить("path", "/foo/bar");
	Значения.Вставить("empty", "");
	Значения.Вставить("undef", Неопределено);

	Примеры = Новый Соответствие;
	Примеры.Вставить("{var}", "value");
	Примеры.Вставить("{hello}", "Hello%20World%21");
	Примеры.Вставить("{+path}/here", "/foo/bar/here");
	Примеры.Вставить("X{#hello}", "X#Hello%20World!");
	Примеры.Вставить("X{.var}", "X.value");
	Примеры.Вставить("{/var,empty}", "/value/");
	Примеры.Вставить("{;var,empty}", ";var=value;empty");
	Примеры.Вставить("{?var,empty,undef}", "?var=value&empty=");
	Примеры.Вставить("?fixed=yes{&var}", "?fixed=yes&var=value");
	Примеры.Вставить("{?undef}", "");
	Примеры.Вставить("{#empty}", "#");

	// Действие и Проверка
	Для Каждого Пример Из Примеры Цикл
		Результат = Новый ШаблонURI(Пример.Ключ).Раскрыть(Значения);
		Ожидаем.Что(Результат.КодированноеПредставление()).Равно(Пример.Значение);
	КонецЦикла;

КонецПроцедуры

&Тест
Процедура ТестДолжен_КодироватьЛитералыИПроцентныеПоследовательности() Экспорт

	// Подготовка
	Значения = Новый Соответствие;
	Значения.Вставить("id", "admin%2F");
	Значения.Вставить("bad", "%foo");

	// Действие
	Результат = Новый ШаблонURI("café/{id}/{+id}/{+bad}").Раскрыть(Значения);

	// Проверка
	Ожидаем.Что(Результат.КодированноеПредставление()).Равно(
		"caf%C3%A9/admin%252F/admin%2F/%25foo"
	);

КонецПроцедуры

#КонецОбласти
