#Использовать asserts
#Использовать "../../src"

Перем _Шаблон; // ШаблонURI
Перем _Результаты; // Массив
Перем _Блокировка; // БлокировкаРесурса

#Область ОбработчикиСобытий

&ТестовыйНабор(Характер = "Одиночка")
Процедура ПриСозданииОбъекта() Экспорт

КонецПроцедуры

#КонецОбласти

#Область Тесты

&Тест
Процедура ТестДолжен_ОдновременноРаскрытьОдинШаблон() Экспорт

	// Подготовка
	КоличествоЗаданий = 12;
	_Шаблон = Новый ШаблонURI("https://example.com{/id}{?page}");
	_Результаты = Новый Массив;
	_Блокировка = Новый БлокировкаРесурса;
	Менеджер = Новый МенеджерФоновыхЗаданий;

	Для НомерЗадания = 0 По КоличествоЗаданий - 1 Цикл
		_Результаты.Добавить(Неопределено);
		Параметры = Новый Массив;
		Параметры.Добавить(НомерЗадания);
		Менеджер.Выполнить(ЭтотОбъект, "РаскрытьВПотоке", Параметры, Истина);
	КонецЦикла;

	// Действие
	Менеджер.ОжидатьЗавершенияЗадач();

	// Проверка
	Для НомерЗадания = 0 По КоличествоЗаданий - 1 Цикл
		Ожидаем.Что(_Результаты[НомерЗадания]).Равно(
			"https://example.com/" + XMLСтрока(НомерЗадания) + "?page=" + XMLСтрока(НомерЗадания)
		);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура РаскрытьВПотоке(НомерЗадания) Экспорт

	Значения = Новый ФиксированнаяСтруктура("id,page", НомерЗадания, НомерЗадания);
	Представление = _Шаблон.Раскрыть(Значения).КодированноеПредставление();

	_Блокировка.Заблокировать();
	_Результаты[НомерЗадания] = Представление;
	_Блокировка.Разблокировать();

КонецПроцедуры

#КонецОбласти
