#Использовать asserts
#Использовать "../../src"
#Использовать "../fixtures"

#Область Тесты

&Тест
Процедура ТестДолжен_СериализоватьФорму() Экспорт

	// Подготовка
	Параметры = Новый ПараметрыURL();
	Параметры
		.Добавить("пробел", "a b")
		.Добавить("плюс", "+")
		.Добавить("символы", "~!()'%Ф")
		.Добавить("пусто", "");

	// Действие
	Результат = Параметры.ВСтроку();

	// Проверка
	Ожидаем.Что(Результат).Равно(
		"%D0%BF%D1%80%D0%BE%D0%B1%D0%B5%D0%BB=a+b&%D0%BF%D0%BB%D1%8E%D1%81=%2B"
		+ "&%D1%81%D0%B8%D0%BC%D0%B2%D0%BE%D0%BB%D1%8B=%7E%21%28%29%27%25%D0%A4&"
		+ "%D0%BF%D1%83%D1%81%D1%82%D0%BE="
	);

КонецПроцедуры

&Тест
Процедура ТестДолжен_НормализоватьФлаг() Экспорт

	// Подготовка
	Параметры = Новый ПараметрыURL("flag");

	// Действие
	Результат = Параметры.ВСтроку();

	// Проверка
	Ожидаем.Что(Результат).Равно("flag=");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ВозвращатьСебя() Экспорт

	// Подготовка
	Параметры = Новый ПараметрыURL();

	// Действие
	ПослеДобавления = Параметры.Добавить("a", "1");
	ПослеУстановки = Параметры.Установить("a", "2");
	ПослеУдаления = Параметры.Удалить("a");
	ПослеОчистки = Параметры.Очистить();
	ПослеСортировки = Параметры.Сортировать();

	// Проверка
	Ожидаем.Что(ПослеДобавления).Идентично(Параметры);
	Ожидаем.Что(ПослеУстановки).Идентично(Параметры);
	Ожидаем.Что(ПослеУдаления).Идентично(Параметры);
	Ожидаем.Что(ПослеОчистки).Идентично(Параметры);
	Ожидаем.Что(ПослеСортировки).Идентично(Параметры);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ОтклонятьТипыВМетодахИзменения() Экспорт

	// Действие и Проверка
	ПомощникТестированияURL.ПроверитьКодОшибки(
		Новый Действие(ЭтотОбъект, "ДобавитьСNull"),
		"argument.invalid_type"
	);
	ПомощникТестированияURL.ПроверитьКодОшибки(
		Новый Действие(ЭтотОбъект, "УстановитьСНеопределено"),
		"argument.invalid_type"
	);
	ПомощникТестированияURL.ПроверитьКодОшибки(
		Новый Действие(ЭтотОбъект, "УдалитьСNull"),
		"argument.invalid_type"
	);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьСNull() Экспорт

	Параметры = Новый ПараметрыURL();
	Параметры.Добавить(Null, "значение");

КонецПроцедуры

Процедура УстановитьСНеопределено() Экспорт

	Параметры = Новый ПараметрыURL();
	Параметры.Установить("имя", Неопределено);

КонецПроцедуры

Процедура УдалитьСNull() Экспорт

	Параметры = Новый ПараметрыURL();
	Параметры.Удалить(Null);

КонецПроцедуры

#КонецОбласти
